src/Web/Web Host/Digital-Ocean.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Digital Ocean
#+OPTIONS: num:nil H:2


* Set Up SSH Keys
** Create the RSA key pair on the client machine
#+begin_src sh
ssh-keygen -t rsa
Enter file in which to save the key (/home/demo/.ssh/id_rsa):
Enter passphrase (empty for no passphrase):
#+end_src

** Copy the Public Key
#+begin_src sh
#1 use ssh-copy-id command
ssh-copy-id user@123.45.56.78
#2 use SSH
cat ~/.ssh/id_rsa.pub | ssh user@123.45.56.78 "cat >> ~/.ssh/authorized_keys"
#+end_src

** [Optional] Disable the Password for Root Login
#+begin_src sh
sudo nano /etc/ssh/sshd_config
#fine the line that includes PermitRootLogin and modify it
PermitRootLogin without-password
reload ssh
#+end_src

* Setting up a new user[fn:1]
** Create a New User
#+begin_src sh
adduser demo
#+end_src
** add Root Privileges to the New User
#+begin_src sh
visudo

# User privilege specification
root    ALL=(ALL:ALL) ALL
#Under there, add the following line, granting all the permissions to your new user
demo    ALL=(ALL:ALL) ALL
#+end_src
** Configure SSH (OPTIONAL)
#+begin_src sh
nano /etc/ssh/sshd_config
Port 25000
Protocol 2
PermitRootLogin no
#+end_src
*PermitRootLogin*: change this from yes to no to stop future root login.
You will now only be logging on as the new user.


Add these lines to the bottom of the document, replacing *demo* in the
AllowUsers line with your username. (AllowUsers will limit login to
only the users on that line. To avoid this, skip this line):
#+begin_src sh
UseDNS no
AllowUsers demo
#+end_src
** Reload and Done
#+begin_src sh
reload ssh
ssh -p 25000 demo@123.45.67.890
#+end_src

* SFTP and SCP
** SCP
#+begin_src sh
scp ~/Downloads/backup_db.sql.gz username@server_ip_address:
#+end_src
** SFTP
#+begin_src sh
sftp username@remote_hostname_or_IP
#download files from our remote host
get remoteFile
#Transferring files to the remote system
put localFile
#+end_src

* Security
** How To Protect SSH with fail2ban on Ubuntu 12.04[fn:2]
** How To Install DenyHosts on Ubuntu 12.04[fn:3]
* How To Add Swap on Ubuntu 12.04[fn:4]
** Check for Swap Space
#+begin_src sh
sudo swapon -s
#An empty list will confirm that you have no swap files enabled:
Filename				Type		Size	Used	Priority
#+end_src
** Create and Enable the Swap File
1024*512k=512M swap space
#+begin_src sh
sudo dd if=/dev/zero of=/swapfile bs=1024 count=512k
sudo mkswap /swapfile
#The results display:
Setting up swapspace version 1, size = 262140 KiB
no label, UUID=103c4545-5fc5-47f3-a8b3-dfbdb64fd7eb
#Finish up by activating the swap file:
sudo swapon /swapfile
#You will then be able to see the new swap file when you view the swap summary.
swapon -s
Filename				Type		Size	Used	Priority
/swapfile                               file		262140	0	-1
#the swap is permanent by adding it to the fstab file
sudo nano /etc/fstab
#Paste in the following line:
 /swapfile       none    swap    sw      0       0 
#+end_src

** More Setting
Swappiness in the file should be set to 0. Skipping this step may
cause both poor performance, whereas setting it to 0 will cause swap
to act as an emergency buffer, preventing out-of-memory crashes.

You can do this with the following commands:
#+begin_src sh
echo 0 | sudo tee /proc/sys/vm/swappiness
echo vm.swappiness = 0 | sudo tee -a /etc/sysctl.conf
#+end_src

To prevent the file from being world-readable, set up the correct
permissions on the swap file:
#+begin_src sh
sudo chown root:root /swapfile 
sudo chmod 0600 /swapfile
#+end_src
* How To Install Linux, nginx, MySQL, PHP (LEMP) stack on Ubuntu 12.04[fn:5]
