public_html/Web/Web Host/Digital-Ocean.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Digital Ocean</title>
<!-- 2014-10-27 Mon 22:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Digital Ocean</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Set Up SSH Keys</a>
<ul>
<li><a href="#sec-1-1">Create the RSA key pair on the client machine</a></li>
<li><a href="#sec-1-2">Copy the Public Key</a></li>
<li><a href="#sec-1-3">[Optional] Disable the Password for Root Login</a></li>
</ul>
</li>
<li><a href="#sec-2">Setting up a new user</a>
<ul>
<li><a href="#sec-2-1">Create a New User</a></li>
<li><a href="#sec-2-2">add Root Privileges to the New User</a></li>
<li><a href="#sec-2-3">Configure SSH (OPTIONAL)</a></li>
<li><a href="#sec-2-4">Reload and Done</a></li>
</ul>
</li>
<li><a href="#sec-3">SFTP and SCP</a>
<ul>
<li><a href="#sec-3-1">SCP</a></li>
<li><a href="#sec-3-2">SFTP</a></li>
</ul>
</li>
<li><a href="#sec-4">Security</a>
<ul>
<li><a href="#sec-4-1">How To Protect SSH with fail2ban on Ubuntu 12.04</a></li>
<li><a href="#sec-4-2">How To Install DenyHosts on Ubuntu 12.04</a></li>
</ul>
</li>
<li><a href="#sec-5">How To Add Swap on Ubuntu 12.04</a>
<ul>
<li><a href="#sec-5-1">Check for Swap Space</a></li>
<li><a href="#sec-5-2">Create and Enable the Swap File</a></li>
<li><a href="#sec-5-3">More Setting</a></li>
</ul>
</li>
<li><a href="#sec-6">How To Install Linux, nginx, MySQL, PHP (LEMP) stack on Ubuntu 12.04</a>
<ul>
<li><a href="#sec-6-1">Update Apt-Get</a></li>
<li><a href="#sec-6-2">Install MySQL</a></li>
<li><a href="#sec-6-3">Install nginx</a></li>
<li><a href="#sec-6-4">Install PHP</a></li>
<li><a href="#sec-6-5">Configure php</a></li>
<li><a href="#sec-6-6">Configure nginx</a></li>
<li><a href="#sec-6-7">Create a php Info Page for Test[option]</a></li>
</ul>
</li>
<li><a href="#sec-7">Migrate Wordpress to Nginx</a>
<ul>
<li><a href="#sec-7-1">Restore Database</a></li>
<li><a href="#sec-7-2">Basic NGINX Optimization</a></li>
<li><a href="#sec-7-3">Creating NGINX .conf files</a></li>
<li><a href="#sec-7-4">Creating Server Blocks</a></li>
<li><a href="#sec-7-5">Restore Wordpress Files</a></li>
</ul>
</li>
<li><a href="#sec-8">MySQL Tips</a>
<ul>
<li><a href="#sec-8-1">list MySQL user</a></li>
<li><a href="#sec-8-2">Create and Delete a MySQL Database</a></li>
<li><a href="#sec-8-3">Access a MySQL Database</a></li>
<li><a href="#sec-8-4">Create a MySQL Table</a></li>
<li><a href="#sec-8-5">Add Information to a MySQL Table</a></li>
<li><a href="#sec-8-6">Update Information in the Table</a></li>
<li><a href="#sec-8-7">Add and Delete a Column</a></li>
<li><a href="#sec-8-8">Delete a Row</a></li>
</ul>
</li>
<li><a href="#sec-9">How To Create a SSL Certificate on nginx for Ubuntu 12.04</a>
<ul>
<li><a href="#sec-9-1">Create a Directory for the Certificate</a></li>
<li><a href="#sec-9-2">Create the Server Key and Certificate Signing Request</a></li>
<li><a href="#sec-9-3">Remove the Passphrase</a></li>
<li><a href="#sec-9-4">Sign your SSL Certificate</a></li>
<li><a href="#sec-9-5">Set Up the Certificate for Test [option]</a></li>
<li><a href="#sec-9-6">Activate the Virtual Host</a></li>
</ul>
</li>
<li><a href="#sec-10">Nginx and PHP5-FPM Configuration and Optimizing Tips</a>
<ul>
<li><a href="#sec-10-1">high memory of php5-fpm</a></li>
<li><a href="#sec-10-2">Nginx</a></li>
<li><a href="#sec-10-3">PHP5-FPM</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Set Up SSH Keys</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Create the RSA key pair on the client machine</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh">ssh-keygen -t rsa
Enter file<span style="color: #00ffff;"> in</span> which to save the key (/home/demo/.ssh/id_rsa):
Enter passphrase (empty for no passphrase):
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Copy the Public Key</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">1 use ssh-copy-id command</span>
ssh-copy-id user@123.45.56.78
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">2 use SSH</span>
cat ~/.ssh/id_rsa.pub | ssh user@123.45.56.78 <span style="color: #ffa07a;">"cat &gt;&gt; ~/.ssh/authorized_keys"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">[Optional] Disable the Password for Root Login</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-sh">sudo nano /etc/ssh/sshd_config
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">fine the line that includes PermitRootLogin and modify it</span>
PermitRootLogin without-password
reload ssh
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Setting up a new user<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Create a New User</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">adduser demo
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">add Root Privileges to the New User</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">visudo

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">User privilege specification</span>
root    <span style="color: #eedd82;">ALL</span>=(ALL:ALL) ALL
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Under there, add the following line, granting all the permissions to your new user</span>
demo    <span style="color: #eedd82;">ALL</span>=(ALL:ALL) ALL
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Configure SSH (OPTIONAL)</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">nano /etc/ssh/sshd_config
Port 25000
Protocol 2
PermitRootLogin no
</pre>
</div>
<p>
<b>PermitRootLogin</b>: change this from yes to no to stop future root login.
You will now only be logging on as the new user.
</p>


<p>
Add these lines to the bottom of the document, replacing <b>demo</b> in the
AllowUsers line with your username. (AllowUsers will limit login to
only the users on that line. To avoid this, skip this line):
</p>
<div class="org-src-container">

<pre class="src src-sh">UseDNS no
AllowUsers demo
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Reload and Done</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-sh">reload ssh
ssh -p 25000 demo@123.45.67.890
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">SFTP and SCP</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">SCP</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">scp ~/Downloads/backup_db.sql.gz username@server_ip_address:
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">SFTP</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh">sftp username@remote_hostname_or_IP
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">download files from our remote host</span>
get remoteFile
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Transferring files to the remote system</span>
put localFile
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Security</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">How To Protect SSH with fail2ban on Ubuntu 12.04<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup></h3>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">How To Install DenyHosts on Ubuntu 12.04<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup></h3>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">How To Add Swap on Ubuntu 12.04<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup></h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Check for Swap Space</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-sh">sudo swapon -s
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">An empty list will confirm that you have no swap files enabled:</span>
Filename                                Type            Size    Used    Priority
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Create and Enable the Swap File</h3>
<div class="outline-text-3" id="text-5-2">
<p>
1024*512k=512M swap space
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo dd <span style="color: #eedd82;">if</span>=/dev/zero <span style="color: #eedd82;">of</span>=/swapfile <span style="color: #eedd82;">bs</span>=1024 <span style="color: #eedd82;">count</span>=512k
sudo mkswap /swapfile
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">The results display:</span>
Setting up swapspace version 1, <span style="color: #eedd82;">size</span> = 262140 KiB
no label, <span style="color: #eedd82;">UUID</span>=103c4545-5fc5-47f3-a8b3-dfbdb64fd7eb
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Finish up by activating the swap file:</span>
sudo swapon /swapfile
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">You will then be able to see the new swap file when you view the swap summary.</span>
swapon -s
Filename                                Type            Size    Used    Priority
/swapfile                               file            262140  0       -1
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">the swap is permanent by adding it to the fstab file</span>
sudo nano /etc/fstab
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Paste in the following line:</span>
 /swapfile       none    swap    sw      0       0
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">More Setting</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Swappiness in the file should be set to 0. Skipping this step may
cause both poor performance, whereas setting it to 0 will cause swap
to act as an emergency buffer, preventing out-of-memory crashes.
</p>

<p>
You can do this with the following commands:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">echo</span> 0 | sudo tee /proc/sys/vm/swappiness
<span style="color: #b0c4de;">echo</span> vm.swappiness = 0 | sudo tee -a /etc/sysctl.conf
</pre>
</div>

<p>
To prevent the file from being world-readable, set up the correct
permissions on the swap file:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo chown root:root /swapfile 
sudo chmod 0600 /swapfile
</pre>
</div>
</div>
</div>
</div>
