src/Web/Web Host/Digital-Ocean.org
** Update Apt-Get
#+begin_src sh
sudo apt-get update
#+end_src
** Install MySQL
#+begin_src sh
sudo apt-get install mysql-server mysql-client
#+end_src

*** configuration
Once you have installed MySQL, we should activate it with this
command:
#+begin_src sh
sudo mysql_install_db
#+end_src

Finish up by running the MySQL set up script:
#+begin_src sh
sudo /usr/bin/mysql_secure_installation
#+end_src

It’s easiest just to say Yes to all the options. At the end, MySQL
will reload and implement the new changes.
#+begin_src sh
By default, a MySQL installation has an anonymous user, allowing anyone
to log into MySQL without having to have a user account created for
them.  This is intended only for testing, and to make the installation
go a bit smoother.  You should remove them before moving into a
production environment.

Remove anonymous users? [Y/n] y                                            
 ... Success!

Normally, root should only be allowed to connect from 'localhost'.  This
ensures that someone cannot guess at the root password from the network.

Disallow root login remotely? [Y/n] y
... Success!

By default, MySQL comes with a database named 'test' that anyone can
access.  This is also intended only for testing, and should be removed
before moving into a production environment.

Remove test database and access to it? [Y/n] y
 - Dropping test database...
 ... Success!
 - Removing privileges on test database...
 ... Success!

Reloading the privilege tables will ensure that all changes made so far
will take effect immediately.

Reload privilege tables now? [Y/n] y
 ... Success!

Cleaning up...
#+end_src
** Install nginx
#+begin_src sh
sudo apt-get install nginx
#+end_src

start nginx
#+begin_src sh
sudo service nginx start
#+end_src

You can confirm that nginx has installed an your web server by
directing your browser to your IP address. You can run the following
command to reveal your VPS's IP address.
#+begin_src sh
ifconfig eth0 | grep inet | awk '{ print $2 }'
#+end_src
** Install PHP
#+begin_src sh
sudo apt-get install php5-fpm
sudo apt-get install php5-mysql php5-gd php5-xdebug php-apc
#+end_src
php5-gd: This package provides a module for handling graphics directly
from PHP scripts. It supports the PNG, JPEG, XPM formats as well as
Freetype/ttf fonts.

More:
+ APC (php-pecl-apc) – APC caches and optimizes PHP intermediate code
+ CLI (php-cli) – Command-line interface for PHP
+ PEAR (php-pear) – PHP Extension and Application Repository framework
+ PDO (php-pdo) – A database access abstraction module for PHP applications
+ MySQL (php-mysqlnd) – A module for PHP applications that use MySQL databases
+ PostgreSQL (php-pgsql) – A PostgreSQL database module for PHP
+ MongoDB (php-pecl-mongo) – PHP MongoDB database driver
+ SQLite (php-sqlite) – Extension for the SQLite V2 Embeddable SQL Database Engine
+ Memcache (php-pecl-memcache) – Extension to work with the Memcached caching daemon
+ Memcached (php-pecl-memcached) – Extension to work with the Memcached caching daemon
+ GD (php-gd) – A module for PHP applications for using the gd graphics library
+ XML (php-xml) – A module for PHP applications which use XML
+ MBString (php-mbstring) – A module for PHP applications which need multi-byte string handling
+ MCrypt (php-mcrypt) – Standard PHP module provides mcrypt library support

** Configure php
#+begin_src sh
sudo nano /etc/php5/fpm/php.ini
cgi.fix_pathinfo=0
#+end_src
Find the line, =cgi.fix_pathinfo=1=, and change the 1 to 0.

If this number is kept as 1, the php interpreter will do its best to
process the file that is as near to the requested file as possible.
This is a possible security risk. If this number is set to 0,
conversely, the interpreter will only process the exact file path—a
much safer alternative.

We need to make another small change in the php5-fpm configuration.
#+begin_src sh
sudo nano /etc/php5/fpm/pool.d/www.conf
listen = /var/run/php5-fpm.sock
sudo service php5-fpm restart
#+end_src
** Configure nginx
#+begin_src sh
sudo nano /etc/nginx/sites-available/default

server {
        listen   80;

        root /usr/share/nginx/www;
        index index.html index.htm index.php;

        server_name yourdomain.com www.yourdomain.com;

        location / {
                #try to find the requested uri or redirect to index.php with request args
                try_files $uri $uri/ /index.php?$args;
        }

        error_page 404 /404.html;

        error_page 500 502 503 504 /50x.html;
        location = /50x.html {
                root /usr/share/nginx/www;
        }

        # pass the PHP scripts to FastCGI server listening on 127.0.0.1:9000
        #
        location ~ \.php$ {
                fastcgi_split_path_info ^(.+\.php)(/.+)$;
                fastcgi_pass unix:/var/run/php5-fpm.sock;
                fastcgi_index index.php;
                include fastcgi_params;
        }

}
#+end_src
** Create a php Info Page for Test[option]
#+begin_src sh
sudo nano /usr/share/nginx/www/info.php
#Add in the following line:
<?php
phpinfo();
?>
#Restart nginx
sudo service nginx restart
#visiting http://youripaddress/info.php
#+end_src

* Migrate Wordpress to Nginx[fn:6][fn:7]
** Restore Database
#+begin_src sh
mysql -u root -p
CREATE DATABASE wordpress;
CREATE USER wordpressuser@localhost;
SET PASSWORD FOR wordpressuser@localhost= PASSWORD("password");
GRANT ALL PRIVILEGES ON wordpress.* TO wordpressuser@localhost;
FLUSH PRIVILEGES;
mysql -h localhost -u wordpressuser  -p wordpress < ./wordpress.sql
#+end_src
