public_html/Web/Web Host/Digital-Ocean.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">How To Install Linux, nginx, MySQL, PHP (LEMP) stack on Ubuntu 12.04<sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup></h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Update Apt-Get</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get update
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Install MySQL</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install mysql-server mysql-client
</pre>
</div>
</div>

<ul class="org-ul"><li><a id="sec-6-2-1" name="sec-6-2-1"></a>configuration<br  /><div class="outline-text-4" id="text-6-2-1">
<p>
Once you have installed MySQL, we should activate it with this
command:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo mysql_install_db
</pre>
</div>

<p>
Finish up by running the MySQL set up script:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo /usr/bin/mysql_secure_installation
</pre>
</div>

<p>
It’s easiest just to say Yes to all the options. At the end, MySQL
will reload and implement the new changes.
</p>
<div class="org-src-container">

<pre class="src src-sh">By default, a MySQL installation has an anonymous user, allowing anyone
to log into MySQL without having to have a user account created for
them.  This is intended only for testing, and to make the installation
go a bit smoother.  You should remove them before moving into a
production environment.

Remove anonymous users? [Y/n] y                                            
 ... Success!

Normally, root should only be allowed to connect from <span style="color: #ffa07a;">'localhost'</span>.  This
ensures that someone cannot guess at the root password from the network.

Disallow root login remotely? [Y/n] y
... Success!

By default, MySQL comes with a database named <span style="color: #ffa07a;">'test'</span> that anyone can
access.  This is also intended only for testing, and should be removed
before moving into a production environment.

Remove test database and access to it? [Y/n] y
 - Dropping test database...
 ... Success!
 - Removing privileges on test database...
 ... Success!

Reloading the privilege tables will ensure that all changes made so far
will take effect immediately.

Reload privilege tables now? [Y/n] y
 ... Success!

Cleaning up...
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3">Install nginx</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install nginx
</pre>
</div>

<p>
start nginx
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo service nginx start
</pre>
</div>

<p>
You can confirm that nginx has installed an your web server by
directing your browser to your IP address. You can run the following
command to reveal your VPS's IP address.
</p>
<div class="org-src-container">

<pre class="src src-sh">ifconfig eth0 | grep inet | awk <span style="color: #ffa07a;">'{ print $2 }'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4">Install PHP</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install php5-fpm
sudo apt-get install php5-mysql php5-gd php5-xdebug php-apc
</pre>
</div>
<p>
php5-gd: This package provides a module for handling graphics directly
from PHP scripts. It supports the PNG, JPEG, XPM formats as well as
Freetype/ttf fonts.
</p>

<p>
More:
</p>
<ul class="org-ul">
<li>APC (php-pecl-apc) – APC caches and optimizes PHP intermediate code
</li>
<li>CLI (php-cli) – Command-line interface for PHP
</li>
<li>PEAR (php-pear) – PHP Extension and Application Repository framework
</li>
<li>PDO (php-pdo) – A database access abstraction module for PHP applications
</li>
<li>MySQL (php-mysqlnd) – A module for PHP applications that use MySQL databases
</li>
<li>PostgreSQL (php-pgsql) – A PostgreSQL database module for PHP
</li>
<li>MongoDB (php-pecl-mongo) – PHP MongoDB database driver
</li>
<li>SQLite (php-sqlite) – Extension for the SQLite V2 Embeddable SQL Database Engine
</li>
<li>Memcache (php-pecl-memcache) – Extension to work with the Memcached caching daemon
</li>
<li>Memcached (php-pecl-memcached) – Extension to work with the Memcached caching daemon
</li>
<li>GD (php-gd) – A module for PHP applications for using the gd graphics library
</li>
<li>XML (php-xml) – A module for PHP applications which use XML
</li>
<li>MBString (php-mbstring) – A module for PHP applications which need multi-byte string handling
</li>
<li>MCrypt (php-mcrypt) – Standard PHP module provides mcrypt library support
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5">Configure php</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">

<pre class="src src-sh">sudo nano /etc/php5/fpm/php.ini
cgi.fix_pathinfo=0
</pre>
</div>
<p>
Find the line, cgi.fix<sub>pathinfo</sub>=1, and change the 1 to 0.
</p>

<p>
If this number is kept as 1, the php interpreter will do its best to
process the file that is as near to the requested file as possible.
This is a possible security risk. If this number is set to 0,
conversely, the interpreter will only process the exact file path—a
much safer alternative.
</p>

<p>
We need to make another small change in the php5-fpm configuration.
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo nano /etc/php5/fpm/pool.d/www.conf
<span style="color: #eedd82;">listen</span> = /var/run/php5-fpm.sock
sudo service php5-fpm restart
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6">Configure nginx</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">

<pre class="src src-sh">sudo nano /etc/nginx/sites-available/default

server {
        listen   80;

        root /usr/share/nginx/www;
        index index.html index.htm index.php;

        server_name yourdomain.com www.yourdomain.com;

        location / {
                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">try to find the requested uri or redirect to index.php with request args</span>
                try_files $<span style="color: #eedd82;">uri</span> $<span style="color: #eedd82;">uri</span>/ /index.php?$<span style="color: #eedd82;">args</span>;
        }

        error_page 404 /404.html;

        error_page 500 502 503 504 /50x.html;
        <span style="color: #eedd82;">location</span> = /50x.html {
                root /usr/share/nginx/www;
        }

        <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">pass the PHP scripts to FastCGI server listening on 127.0.0.1:9000</span>
        <span style="color: #ff7f24;">#</span>
        location ~ <span style="color: #ffa07a;">\.</span>php$ {
                fastcgi_split_path_info ^(.+<span style="color: #ffa07a;">\.</span>php)(/.+)$;
                fastcgi_pass unix:/var/run/php5-fpm.sock;
                fastcgi_index index.php;
                include fastcgi_params;
        }

}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7">Create a php Info Page for Test[option]</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">

<pre class="src src-sh">sudo nano /usr/share/nginx/www/info.php
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Add in the following line:</span>
&lt;?php
<span style="color: #87cefa;">phpinfo</span>();
?&gt;
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Restart nginx</span>
sudo service nginx restart
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">visiting http://youripaddress/info.php</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Migrate Wordpress to Nginx<sup><a id="fnr.6" name="fnr.6" class="footref" href="#fn.6">6</a></sup><sup>, </sup><sup><a id="fnr.7" name="fnr.7" class="footref" href="#fn.7">7</a></sup></h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Restore Database</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-sh">mysql -u root -p
CREATE DATABASE wordpress;
CREATE USER wordpressuser@localhost;
SET PASSWORD FOR wordpressuser@<span style="color: #eedd82;">localhost</span>= PASSWORD(<span style="color: #ffa07a;">"password"</span>);
GRANT ALL PRIVILEGES ON wordpress.* TO wordpressuser@localhost;
FLUSH PRIVILEGES;
mysql -h localhost -u wordpressuser  -p wordpress &lt; ./wordpress.sql
</pre>
</div>
</div>
</div>
