src/Web/Web Host/Digital-Ocean.org
** Basic NGINX Optimization
Increase or decrease the number of workers depending on your system's
specs:
#+begin_src sh
sudo nano /etc/nginx/nginx.conf
worker_processes 1;
#NGINX limits the number of connections that a worker can maintain at one time, if your websites have many visitors you might want to increase the limit of connections
worker_connections 768;
#Enabling Gzip
gzip on;
gzip_types text/css text/x-component application/x-javascript application/javascript text/javascript text/x-js text/richtext image/svg+xml text/plain text/xsd text/xsl text/xml image/x-icon;
#+end_src
Files can be compressed using Gzip to accelerate WordPress, the
smaller the data size requested by the user, the faster the response.
Think about CSS files & HTML files, they have many similar strings,
repeated text and white spaces.
** Creating NGINX .conf files
create 3 files that will hold our configurations:

+ common.conf: Configurations applicable to all sites.
+ wordpress.conf: Configurations applicable to all WordPress sites.
+ multisite.conf: Special configurations for WordPress multisite with
  sub-directories.
*** create the dir
#+begin_src sh
sudo mkdir /etc/nginx/global
cd /etc/nginx/global
#+end_src
*** common.conf file
#+begin_src sh
sudo nano common.conf

# Global configuration file.
# ESSENTIAL : Configure Nginx Listening Port
listen 80;
# ESSENTIAL : Default file to serve. If the first file isn't found, 
index index.php index.html index.htm;
# ESSENTIAL : no favicon logs
location = /favicon.ico {
    log_not_found off;
    access_log off;
}
# ESSENTIAL : robots.txt
location = /robots.txt {
    allow all;
    log_not_found off;
    access_log off;
}
# ESSENTIAL : Configure 404 Pages
error_page 404 /404.html;
# ESSENTIAL : Configure 50x Pages
error_page 500 502 503 504 /50x.html;
    location = /50x.html {
        root /usr/share/nginx/www;
    }
# SECURITY : Deny all attempts to access hidden files .abcde
location ~ /\. {
    deny all;
}
# PERFORMANCE : Set expires headers for static files and turn off logging.
location ~* ^.+\.(js|css|swf|xml|txt|ogg|ogv|svg|svgz|eot|otf|woff|mp4|ttf|rss|atom|jpg|jpeg|gif|png|ico|zip|tgz|gz|rar|bz2|doc|xls|exe|ppt|tar|mid|midi|wav|bmp|rtf)$ {
    access_log off; log_not_found off; expires 30d;
}
#+end_src

=location = /robots.txt {allow all;}= allows the access to robots.txt,
if you want to specify another directory for the robots.txt you can
add an alias:

#+begin_src sh
location /robots.txt {
    alias /var/www/example.com/public/sample_robots.txt;
}
#+end_src
=location ~ /\. {deny all;}= in the Linux operating system a hidden
file begins with a ".", access to some hidden files, such as
=.htaccess=, should be blocked for security reasons.


=location ~* ^.+\.(js|css|swf...= expires headers tell the browser
whether they should request a specific file from the server or whether
they should grab it from the browser's cache. With expires 30d we are
telling the browser to store static files such as pictures for 30
days.

*** wordpress.conf file
#+begin_src sh
sudo nano wordpress.conf

# WORDPRESS : Rewrite rules, sends everything through index.php and keeps the appended query string intact
location / {
    try_files $uri $uri/ /index.php?q=$uri&$args;
}

# SECURITY : Deny all attempts to access PHP Files in the uploads directory
location ~* /(?:uploads|files)/.*\.php$ {
    deny all;
}
# REQUIREMENTS : Enable PHP Support
location ~ \.php$ {
    # SECURITY : Zero day Exploit Protection
    try_files $uri =404;
    # ENABLE : Enable PHP, listen fpm sock
    fastcgi_split_path_info ^(.+\.php)(/.+)$;
    fastcgi_pass unix:/var/run/php5-fpm.sock;
    fastcgi_index index.php;
    include fastcgi_params;
}
#+end_src

=try_files $uri $uri/ /index.php?q=$uri&$args= rewrite rule required
to allow you to choose your custom permalink structure on WordPress.

=location ~* /(?:uploads|files)/.*\.php$ {deny all;}= this will
prevent malicious code from being uploaded and executed from the
WordPress media directory.

=location ~ \.php$ {...}= since WordPress is a php site, we need to
tell NGINX how to a pass our php scripts to PHP5.

=try_files $uri =404;= this is a security rule, you only want to
either serve a determined php file or go to a 404 error.

*** multisite.conf file
#+begin_src sh
sudo nano multisite.conf

# Rewrite rules for WordPress Multi-site.
if (!-e $request_filename) {
rewrite /wp-admin$ $scheme://$host$uri/ permanent;
rewrite ^/[_0-9a-zA-Z-]+(/wp-.*) $1 last;
rewrite ^/[_0-9a-zA-Z-]+(/.*\.php)$ $1 last;
}

#+end_src

** Creating Server Blocks
Have two blogs: =blog.dreamrunner.org= and =other.dreamrunner.org=.
#+begin_src sh
#disable the default server block:
sudo rm /etc/nginx/sites-enabled/default

#And create a server block file:
sudo nano /etc/nginx/sites-available/dreamrun
#+end_src
Add:
#+begin_src sh
server {
    server_name blog.dreamrunner.org;
    root /home/shougang/www/laogangzhi;
    access_log /var/log/nginx/blog.dreamrunner.org.access.log;
    error_log /var/log/nginx/blog.dreamrunner.org.error.log;
    include global/common.conf;
    include global/wordpress.conf;
    include global/multisite.conf;
}

server {
    server_name other.dreamrunner.org;
    root /home/shougang/www/dreamrunner;
    access_log /var/log/nginx/other.dreamrunner.org.access.log;
    error_log /var/log/nginx/other.dreamrunner.org.error.log;
    include global/common.conf;
    include global/wordpress.conf;
    include global/multisite.conf;
}
#+end_src
+ =server_name=: Determine which server block is used for a given URL.
+ =root=: The path where your site is stored.
+ =access log & error log=: Set the paths for your logs
