public_html/Web/Web Host/Digital-Ocean.html
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">Basic NGINX Optimization</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Increase or decrease the number of workers depending on your system's
specs:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo nano /etc/nginx/nginx.conf
worker_processes 1;
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">NGINX limits the number of connections that a worker can maintain at one time, if your websites have many visitors you might want to increase the limit of connections</span>
worker_connections 768;
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Enabling Gzip</span>
gzip on;
gzip_types text/css text/x-component application/x-javascript application/javascript text/javascript text/x-js text/richtext image/svg+xml text/plain text/xsd text/xsl text/xml image/x-icon;
</pre>
</div>
<p>
Files can be compressed using Gzip to accelerate WordPress, the
smaller the data size requested by the user, the faster the response.
Think about CSS files &amp; HTML files, they have many similar strings,
repeated text and white spaces.
</p>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">Creating NGINX .conf files</h3>
<div class="outline-text-3" id="text-7-3">
<p>
create 3 files that will hold our configurations:
</p>

<ul class="org-ul">
<li>common.conf: Configurations applicable to all sites.
</li>
<li>wordpress.conf: Configurations applicable to all WordPress sites.
</li>
<li>multisite.conf: Special configurations for WordPress multisite with
sub-directories.
</li>
</ul>
</div>
<ul class="org-ul"><li><a id="sec-7-3-1" name="sec-7-3-1"></a>create the dir<br  /><div class="outline-text-4" id="text-7-3-1">
<div class="org-src-container">

<pre class="src src-sh">sudo mkdir /etc/nginx/global
<span style="color: #b0c4de;">cd</span> /etc/nginx/global
</pre>
</div>
</div>
</li>
<li><a id="sec-7-3-2" name="sec-7-3-2"></a>common.conf file<br  /><div class="outline-text-4" id="text-7-3-2">
<div class="org-src-container">

<pre class="src src-sh">sudo nano common.conf

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Global configuration file.</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">ESSENTIAL : Configure Nginx Listening Port</span>
listen 80;
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">ESSENTIAL : Default file to serve. If the first file isn't found, </span>
index index.php index.html index.htm;
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">ESSENTIAL : no favicon logs</span>
<span style="color: #eedd82;">location</span> = /favicon.ico {
    log_not_found off;
    access_log off;
}
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">ESSENTIAL : robots.txt</span>
<span style="color: #eedd82;">location</span> = /robots.txt {
    allow all;
    log_not_found off;
    access_log off;
}
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">ESSENTIAL : Configure 404 Pages</span>
error_page 404 /404.html;
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">ESSENTIAL : Configure 50x Pages</span>
error_page 500 502 503 504 /50x.html;
    <span style="color: #eedd82;">location</span> = /50x.html {
        root /usr/share/nginx/www;
    }
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">SECURITY : Deny all attempts to access hidden files .abcde</span>
location ~ /<span style="color: #ffa07a;">\.</span> {
    deny all;
}
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">PERFORMANCE : Set expires headers for static files and turn off logging.</span>
location ~* ^.+<span style="color: #ffa07a;">\.</span>(js|css|swf|xml|txt|ogg|ogv|svg|svgz|eot|otf|woff|mp4|ttf|rss|atom|jpg|jpeg|gif|png|ico|zip|tgz|gz|rar|bz2|doc|xls|exe|ppt|tar|mid|midi|wav|bmp|rtf)$ {
    access_log off; log_not_found off; expires 30d;
}
</pre>
</div>

<p>
<code>location = /robots.txt {allow all;}</code> allows the access to robots.txt,
if you want to specify another directory for the robots.txt you can
add an alias:
</p>

<div class="org-src-container">

<pre class="src src-sh">location /robots.txt {
    <span style="color: #b0c4de;">alias</span> /var/www/example.com/public/sample_robots.txt;
}
</pre>
</div>
<p>
<code>location ~ /\. {deny all;}</code> in the Linux operating system a hidden
file begins with a ".", access to some hidden files, such as
<code>.htaccess</code>, should be blocked for security reasons.
</p>


<p>
<code>location ~* ^.+\.(js|css|swf...</code> expires headers tell the browser
whether they should request a specific file from the server or whether
they should grab it from the browser's cache. With expires 30d we are
telling the browser to store static files such as pictures for 30
days.
</p>
</div>
</li>

<li><a id="sec-7-3-3" name="sec-7-3-3"></a>wordpress.conf file<br  /><div class="outline-text-4" id="text-7-3-3">
<div class="org-src-container">

<pre class="src src-sh">sudo nano wordpress.conf

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">WORDPRESS : Rewrite rules, sends everything through index.php and keeps the appended query string intact</span>
location / {
    try_files $<span style="color: #eedd82;">uri</span> $<span style="color: #eedd82;">uri</span>/ /index.php?<span style="color: #eedd82;">q</span>=$<span style="color: #eedd82;">uri</span>&amp;$<span style="color: #eedd82;">args</span>;
}

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">SECURITY : Deny all attempts to access PHP Files in the uploads directory</span>
location ~* /(?:uploads|files)/.*<span style="color: #ffa07a;">\.</span>php$ {
    deny all;
}
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">REQUIREMENTS : Enable PHP Support</span>
location ~ <span style="color: #ffa07a;">\.</span>php$ {
    <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">SECURITY : Zero day Exploit Protection</span>
    try_files $<span style="color: #eedd82;">uri</span> =404;
    <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">ENABLE : Enable PHP, listen fpm sock</span>
    fastcgi_split_path_info ^(.+<span style="color: #ffa07a;">\.</span>php)(/.+)$;
    fastcgi_pass unix:/var/run/php5-fpm.sock;
    fastcgi_index index.php;
    include fastcgi_params;
}
</pre>
</div>

<p>
<code>try_files $uri $uri/ /index.php?q=$uri&amp;$args</code> rewrite rule required
to allow you to choose your custom permalink structure on WordPress.
</p>

<p>
<code>location ~* /(?:uploads|files)/.*\.php$ {deny all;}</code> this will
prevent malicious code from being uploaded and executed from the
WordPress media directory.
</p>

<p>
<code>location ~ \.php$ {...}</code> since WordPress is a php site, we need to
tell NGINX how to a pass our php scripts to PHP5.
</p>

<p>
<code>try_files $uri =404;</code> this is a security rule, you only want to
either serve a determined php file or go to a 404 error.
</p>
</div>
</li>

<li><a id="sec-7-3-4" name="sec-7-3-4"></a>multisite.conf file<br  /><div class="outline-text-4" id="text-7-3-4">
<div class="org-src-container">

<pre class="src src-sh">sudo nano multisite.conf

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Rewrite rules for WordPress Multi-site.</span>
<span style="color: #00ffff;">if</span> (!-e $<span style="color: #eedd82;">request_filename</span>) {
rewrite /wp-admin$ $<span style="color: #eedd82;">scheme</span>://$<span style="color: #eedd82;">host</span>$<span style="color: #eedd82;">uri</span>/ permanent;
rewrite ^/[_0-9a-zA-Z-]+(/wp-.*) $<span style="color: #eedd82;">1</span> last;
rewrite ^/[_0-9a-zA-Z-]+(/.*<span style="color: #ffa07a;">\.</span>php)$ $<span style="color: #eedd82;">1</span> last;
}
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4">Creating Server Blocks</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Have two blogs: <code>blog.dreamrunner.org</code> and <code>other.dreamrunner.org</code>.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">disable the default server block:</span>
sudo rm /etc/nginx/sites-enabled/default

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">And create a server block file:</span>
sudo nano /etc/nginx/sites-available/dreamrun
</pre>
</div>
<p>
Add:
</p>
<div class="org-src-container">

<pre class="src src-sh">server {
    server_name blog.dreamrunner.org;
    root /home/shougang/www/laogangzhi;
    access_log /var/log/nginx/blog.dreamrunner.org.access.log;
    error_log /var/log/nginx/blog.dreamrunner.org.error.log;
    include global/common.conf;
    include global/wordpress.conf;
    include global/multisite.conf;
}

server {
    server_name other.dreamrunner.org;
    root /home/shougang/www/dreamrunner;
    access_log /var/log/nginx/other.dreamrunner.org.access.log;
    error_log /var/log/nginx/other.dreamrunner.org.error.log;
    include global/common.conf;
    include global/wordpress.conf;
    include global/multisite.conf;
}
</pre>
</div>
<ul class="org-ul">
<li><code>server_name</code>: Determine which server block is used for a given URL.
</li>
<li><code>root</code>: The path where your site is stored.
</li>
<li><code>access log &amp; error log</code>: Set the paths for your logs
</li>
</ul>
</div>
</div>
