src/Web/Web Host/Digital-Ocean.org
** Restore Wordpress Files
Copy the Wordpress files to =/home/username/www/= and upzip;
#+begin_src sh
sudo chown www-data:www-data * -R 
sudo usermod -a -G www-data [username]
#in the wp-config.php file add
define( 'FS_METHOD', 'direct' )
#+end_src

* MySQL Tips
** list MySQL user
#+begin_src sh
SELECT User FROM mysql.user;
#+end_src
** Create and Delete a MySQL Database
#+begin_src sh
SHOW DATABASES;
CREATE DATABASE database name;
DROP DATABASE database name;
#+end_src
** Access a MySQL Database
#+begin_src sh
USE events;
SHOW tables; 
#+end_src
** Create a MySQL Table
#+begin_src sh
CREATE TABLE potluck (id INT NOT NULL PRIMARY KEY AUTO_INCREMENT, 
name VARCHAR(20),
food VARCHAR(30),
confirmed CHAR(1), 
signup_date DATE);
#the table’s organization with this command:
DESCRIBE potluck;
#+end_src
** Add Information to a MySQL Table
#+begin_src sh
INSERT INTO `potluck` (`id`,`name`,`food`,`confirmed`,`signup_date`) VALUES (NULL, "John", "Casserole","Y", '2012-04-11');
SELECT * FROM potluck;
#+end_src
** Update Information in the Table
#+begin_src sh
UPDATE `potluck` 
SET 
`confirmed` = 'Y' 
WHERE `potluck`.`name` ='Sandy';
#+end_src
** Add and Delete a Column
#+begin_src sh
ALTER TABLE potluck ADD email VARCHAR(40);
# place that column in a specific spot in the table
ALTER TABLE potluck ADD email VARCHAR(40) AFTER name; 
ALTER TABLE potluck DROP email;
#+end_src
** Delete a Row
#+begin_src sh
DELETE from [table name] where [row name]=[field text];
#+end_src
* How To Create a SSL Certificate on nginx for Ubuntu 12.04
** Create a Directory for the Certificate
The SSL certificate has 2 parts main parts: the certificate itself and
the public key.
#+begin_src sh
sudo mkdir /etc/nginx/ssl
cd /etc/nginx/ssl
#+end_src
** Create the Server Key and Certificate Signing Request
Start by creating the private server key. During this process, you
will be asked to enter a specific passphrase. Be sure to note this
phrase carefully, if you forget it or lose it, you will not be able to
access the certificate.
#+begin_src sh
sudo openssl genrsa -des3 -out server.key 1024
#Follow up by creating a certificate signing request:
sudo openssl req -new -key server.key -out server.csr
#+end_src
This command will prompt terminal to display a lists of fields that need to be filled in.

The most important line is "Common Name". Enter your official domain
name here or, if you don't have one yet, your site's IP address. Leave
the challenge password and optional company name blank.
** Remove the Passphrase
 However, it would serve us to remove the passphrase. Although having
 the passphrase in place does provide heightened security, the issue
 starts when one tries to reload nginx. In the event that nginx
 crashes or needs to reboot, you will always have to re-enter your
 passphrase to get your entire web server back online.
#+begin_src sh
sudo cp server.key server.key.org
sudo openssl rsa -in server.key.org -out server.key
#+end_src
** Sign your SSL Certificate
Keep in mind that you can specify how long the certificate should
remain valid by changing the 365 to the number of days you prefer. As
it stands this certificate will expire after one year.
#+begin_src sh
sudo openssl x509 -req -days 365 -in server.csr -signkey server.key -out server.crt
#+end_src
** Set Up the Certificate for Test [option]
#+begin_src sh
sudo cp /etc/nginx/sites-available/default /etc/nginx/sites-available/example
sudo nano /etc/nginx/sites-available/example

# HTTPS server
server {
        listen 443;
        server_name example.com;

        root /usr/share/nginx/www;
        index index.html index.htm;

        ssl on;
        ssl_certificate /etc/nginx/ssl/server.crt;
        ssl_certificate_key /etc/nginx/ssl/server.key; 
}
#+end_src
** Activate the Virtual Host
#+begin_src sh
sudo ln -s /etc/nginx/sites-available/example /etc/nginx/sites-enabled/example
sudo service nginx restart
#+end_src
* Nginx and PHP5-FPM Configuration and Optimizing Tips
** high memory of php5-fpm
搬移到512Ｍ的digitalocean, Nginx + PHP5-FPM + Wordpress， 发现PHP5-FPM
的memory占用很高。

#+begin_src sh
$ ps -A --sort -rss -o comm,pmem,pcpu | uniq -c | head -15
      1 COMMAND         %MEM %CPU
      1 php5-fpm        21.2  0.0
      1 php5-fpm        21.1  0.0
      1 php5-fpm        19.3  0.0
      1 php5-fpm        17.9  0.0
      1 php5-fpm        17.4  0.0
      1 php5-fpm        16.4  0.0
      1 bash             1.5  4.2
      1 php5-fpm         0.6  0.0
      1 rsyslogd         0.6  0.0
      1 nginx            0.5  0.0
      1 init             0.2  0.0
      1 sshd             0.2  0.1
      1 whoopsie         0.2  0.0
      1 nginx            0.2  0.0

$ free
             total       used       free     shared    buffers     cached
Mem:        502740     476344      26396          0       1120      50460
-/+ buffers/cache:     424764      77976
Swap:       524284          0     524284
#+end_src
** Nginx
*** Organize Nginx Configuration Files
#+begin_src sh
## Main configuration file ##
/etc/nginx/nginx.conf
 
## Virtualhost configuration files on ##
/etc/nginx/sites-available/
/etc/nginx/sites-enabled/
 
## Other config files on (if needed) ##
/etc/nginx/conf.d/
#+end_src
*** =nginx.conf=
#+begin_src sh
worker_processes [number of processor cores];

cat /proc/cpuinfo |grep processor
processor	: 0

worker_processes 1;
#+end_src

