public_html/Web/Web Host/Digital-Ocean.html
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5">Restore Wordpress Files</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Copy the Wordpress files to <code>/home/username/www/</code> and upzip;
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo chown www-data:www-data * -R 
sudo usermod -a -G www-data [username]
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">in the wp-config.php file add</span>
<span style="color: #87cefa;">define</span>( <span style="color: #ffa07a;">'FS_METHOD'</span>, <span style="color: #ffa07a;">'direct'</span> )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">MySQL Tips</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">list MySQL user</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-sh">SELECT User FROM mysql.user;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">Create and Delete a MySQL Database</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-sh">SHOW DATABASES;
CREATE DATABASE database name;
DROP DATABASE database name;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3">Access a MySQL Database</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">

<pre class="src src-sh">USE events;
SHOW tables;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4">Create a MySQL Table</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">

<pre class="src src-sh">CREATE TABLE potluck (id INT NOT NULL PRIMARY KEY AUTO_INCREMENT, 
name VARCHAR(20),
food VARCHAR(30),
confirmed CHAR(1), 
signup_date DATE);
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">the table&#8217;s organization with this command:</span>
DESCRIBE potluck;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5">Add Information to a MySQL Table</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">

<pre class="src src-sh">INSERT INTO <span style="color: #fa8072;">`potluck`</span> (<span style="color: #fa8072;">`id`</span>,<span style="color: #fa8072;">`name`</span>,<span style="color: #fa8072;">`food`</span>,<span style="color: #fa8072;">`confirmed`</span>,<span style="color: #fa8072;">`signup_date`</span>) VALUES (NULL, <span style="color: #ffa07a;">"John"</span>, <span style="color: #ffa07a;">"Casserole"</span>,<span style="color: #ffa07a;">"Y"</span>, <span style="color: #ffa07a;">'2012-04-11'</span>);
SELECT * FROM potluck;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6">Update Information in the Table</h3>
<div class="outline-text-3" id="text-8-6">
<div class="org-src-container">

<pre class="src src-sh">UPDATE <span style="color: #fa8072;">`potluck`</span> 
SET 
<span style="color: #fa8072;">`confirmed`</span> = <span style="color: #ffa07a;">'Y'</span> 
WHERE <span style="color: #fa8072;">`potluck`</span>.<span style="color: #fa8072;">`name`</span> =<span style="color: #ffa07a;">'Sandy'</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7">Add and Delete a Column</h3>
<div class="outline-text-3" id="text-8-7">
<div class="org-src-container">

<pre class="src src-sh">ALTER TABLE potluck ADD email VARCHAR(40);
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">place that column in a specific spot in the table</span>
ALTER TABLE potluck ADD email VARCHAR(40) AFTER name; 
ALTER TABLE potluck DROP email;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-8" class="outline-3">
<h3 id="sec-8-8">Delete a Row</h3>
<div class="outline-text-3" id="text-8-8">
<div class="org-src-container">

<pre class="src src-sh">DELETE from [table name] where [row name]=[field text];
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">How To Create a SSL Certificate on nginx for Ubuntu 12.04</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">Create a Directory for the Certificate</h3>
<div class="outline-text-3" id="text-9-1">
<p>
The SSL certificate has 2 parts main parts: the certificate itself and
the public key.
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo mkdir /etc/nginx/ssl
<span style="color: #b0c4de;">cd</span> /etc/nginx/ssl
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">Create the Server Key and Certificate Signing Request</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Start by creating the private server key. During this process, you
will be asked to enter a specific passphrase. Be sure to note this
phrase carefully, if you forget it or lose it, you will not be able to
access the certificate.
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo openssl genrsa -des3 -out server.key 1024
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Follow up by creating a certificate signing request:</span>
sudo openssl req -new -key server.key -out server.csr
</pre>
</div>
<p>
This command will prompt terminal to display a lists of fields that need to be filled in.
</p>

<p>
The most important line is "Common Name". Enter your official domain
name here or, if you don't have one yet, your site's IP address. Leave
the challenge password and optional company name blank.
</p>
</div>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3">Remove the Passphrase</h3>
<div class="outline-text-3" id="text-9-3">
<p>
However, it would serve us to remove the passphrase. Although having
the passphrase in place does provide heightened security, the issue
starts when one tries to reload nginx. In the event that nginx
crashes or needs to reboot, you will always have to re-enter your
passphrase to get your entire web server back online.
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo cp server.key server.key.org
sudo openssl rsa -in server.key.org -out server.key
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4">Sign your SSL Certificate</h3>
<div class="outline-text-3" id="text-9-4">
<p>
Keep in mind that you can specify how long the certificate should
remain valid by changing the 365 to the number of days you prefer. As
it stands this certificate will expire after one year.
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo openssl x509 -req -days 365 -in server.csr -signkey server.key -out server.crt
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5">Set Up the Certificate for Test [option]</h3>
<div class="outline-text-3" id="text-9-5">
<div class="org-src-container">

<pre class="src src-sh">sudo cp /etc/nginx/sites-available/default /etc/nginx/sites-available/example
sudo nano /etc/nginx/sites-available/example

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">HTTPS server</span>
server {
        listen 443;
        server_name example.com;

        root /usr/share/nginx/www;
        index index.html index.htm;

        ssl on;
        ssl_certificate /etc/nginx/ssl/server.crt;
        ssl_certificate_key /etc/nginx/ssl/server.key; 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9-6" class="outline-3">
<h3 id="sec-9-6">Activate the Virtual Host</h3>
<div class="outline-text-3" id="text-9-6">
<div class="org-src-container">

<pre class="src src-sh">sudo ln -s /etc/nginx/sites-available/example /etc/nginx/sites-enabled/example
sudo service nginx restart
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Nginx and PHP5-FPM Configuration and Optimizing Tips</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1">high memory of php5-fpm</h3>
<div class="outline-text-3" id="text-10-1">
<p>
搬移到512Ｍ的digitalocean, Nginx + PHP5-FPM + Wordpress， 发现PHP5-FPM
的memory占用很高。
</p>

<div class="org-src-container">

<pre class="src src-sh">$ ps -A --sort -rss -o comm,pmem,pcpu | uniq -c | head -15
      1 COMMAND         %MEM %CPU
      1 php5-fpm        21.2  0.0
      1 php5-fpm        21.1  0.0
      1 php5-fpm        19.3  0.0
      1 php5-fpm        17.9  0.0
      1 php5-fpm        17.4  0.0
      1 php5-fpm        16.4  0.0
      1 bash             1.5  4.2
      1 php5-fpm         0.6  0.0
      1 rsyslogd         0.6  0.0
      1 nginx            0.5  0.0
      1 init             0.2  0.0
      1 sshd             0.2  0.1
      1 whoopsie         0.2  0.0
      1 nginx            0.2  0.0

$ free
             total       used       free     shared    buffers     cached
Mem:        502740     476344      26396          0       1120      50460
-/+ buffers/cache:     424764      77976
Swap:       524284          0     524284
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2">Nginx</h3>
<div class="outline-text-3" id="text-10-2">
</div><ul class="org-ul"><li><a id="sec-10-2-1" name="sec-10-2-1"></a>Organize Nginx Configuration Files<br  /><div class="outline-text-4" id="text-10-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff7f24;">## </span><span style="color: #ff7f24;">Main configuration file ##</span>
/etc/nginx/nginx.conf

<span style="color: #ff7f24;">## </span><span style="color: #ff7f24;">Virtualhost configuration files on ##</span>
/etc/nginx/sites-available/
/etc/nginx/sites-enabled/

<span style="color: #ff7f24;">## </span><span style="color: #ff7f24;">Other config files on (if needed) ##</span>
/etc/nginx/conf.d/
</pre>
</div>
</div>
</li>
<li><a id="sec-10-2-2" name="sec-10-2-2"></a><code>nginx.conf</code><br  /><div class="outline-text-4" id="text-10-2-2">
<div class="org-src-container">

<pre class="src src-sh">worker_processes [number of processor cores];

cat /proc/cpuinfo |grep processor
processor       : 0

worker_processes 1;
</pre>
</div>
</div>
</li>
