public_html/Web/Web Host/Digital-Ocean.html

<li><a id="sec-10-2-3" name="sec-10-2-3"></a>under <code>/etc/nginx/conf.d/</code><br  /><div class="outline-text-4" id="text-10-2-3">
<p>
create <code>user.conf</code>:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">The charset directive will not only cause Nginx to re-encode </span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">anything that is not in the defined character set, </span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">it will also add it to the Content-Type HTTP header so browsers know.</span>
charset utf-8;

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">The default Nginx client_max_body_size is 1mb. </span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">That&#8217;s too small for most everything these days</span>
client_max_body_size 32m;
client_body_buffer_size 128k;

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">Hide Nginx Server Tokens / Hide Nginx version number</span>
server_tokens off;
</pre>
</div>

<p>
create <code>ssl.conf</code>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">we want to enable ssl session resumption to avoid</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">having to start the handshake from scratch each page load</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">so first we enable a shared cache, named SSL (creative!) that is 10mb large</span>
ssl_session_cache shared:SSL:10m;

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">save things in the cache for 3 minutes</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">if you're not making a request at least every 3 minutes, this isn't going</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">to accomplish anything anyway</span>
ssl_session_timeout 3m;

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">now we're going to change a bunch related to SSL ciphers and protocol</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">the primary goal here is to be more secure, and i've generally tried to</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">go with things that comply with the Federal Information Processing Standard (FIPS)</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">set by the US government for non-military government use</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">we don't want to support SSLv3, it's known to be insecure</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">FIPS 140-2 compliance, TLS1+ only</span>
ssl_protocols TLSv1 TLSv1.1 TLSv1.2;

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">now we go through a couple different options for the SSL ciphers to support, mainly just to</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">give you a bunch of options to pick from</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">this is a very concise definition of ciphers that don't allow anonymous DH or MD5 - the big weaknesses</span>
<span style="color: #ff7f24;">#       </span><span style="color: #ff7f24;">per: https://calomel.org/nginx.html</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">ssl_ciphers HIGH:!ADH!MD5:@STRENGTH;</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">this is a very (not so) short list of very secure ciphers that may be incompatible with older browsers</span>
<span style="color: #ff7f24;">#       </span><span style="color: #ff7f24;">per: https://calomel.org/nginx.html </span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">ssl_ciphers ECDHE-RSA-AES256-GCM-SHA384:ECDHE-RSA-AES256-SHA384:ECDHE-RSA-AES256-SHA:AES256-GCM-SHA384:AES256-SHA256:AES256-SHA:AES128-SHA;</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">this excludes insecure ciphers and sorts the others by strength</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">it is BEAST-resistant, prioritizing RC4</span>
<span style="color: #ff7f24;">#       </span><span style="color: #ff7f24;">per: http://groups.drupal.org/node/179344</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">ssl_ciphers !aNULL:!LOW:!MD5:!EXP:RC4:CAMELLIA:AES128:3DES:SEED:AES256@STRENGTH;</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">this is a combination of everything above and openssl docs - very secure, FIPS-compliant, ordered by strength</span>
ssl_ciphers !aNULL:!eNULL:FIPS@STRENGTH;

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">don't let the client decide what ciphers to use, we've told the server which to allow</span>
ssl_prefer_server_ciphers on;
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3">PHP5-FPM</h3>
<div class="outline-text-3" id="text-10-3">
</div><ul class="org-ul"><li><a id="sec-10-3-1" name="sec-10-3-1"></a>the Configuration Files<br  /><div class="outline-text-4" id="text-10-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff7f24;">## </span><span style="color: #ff7f24;">Main configuration file ##</span>
/etc/php5/fpm/php-fpm.conf

<span style="color: #ff7f24;">## </span><span style="color: #ff7f24;">last line of php-fpm.conf:include=/etc/php5/fpm/pool.d/*.conf</span>
<span style="color: #ff7f24;">## </span><span style="color: #ff7f24;">Other config files on (if needed) ##</span>
/etc/php5/fpm/pool.d/
</pre>
</div>
</div>
</li>
<li><a id="sec-10-3-2" name="sec-10-3-2"></a><code>pool.d/www.conf</code><br  /><div class="outline-text-4" id="text-10-3-2">
<div class="org-src-container">

<pre class="src src-sh">pm.max_children = 5
pm.start_servers = 2
pm.min_spare_servers = 1
pm.max_spare_servers = 3
<span style="color: #eedd82;">listen</span> = /var/run/php5-fpm.socket
</pre>
</div>
</div>
</li></ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="https://www.digitalocean.com/community/articles/initial-server-setup-with-ubuntu-12-04">https://www.digitalocean.com/community/articles/initial-server-setup-with-ubuntu-12-04</a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="https://www.digitalocean.com/community/articles/how-to-protect-ssh-with-fail2ban-on-ubuntu-12-04">https://www.digitalocean.com/community/articles/how-to-protect-ssh-with-fail2ban-on-ubuntu-12-04</a>
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
<a href="https://www.digitalocean.com/community/articles/how-to-install-denyhosts-on-ubuntu-12-04">https://www.digitalocean.com/community/articles/how-to-install-denyhosts-on-ubuntu-12-04</a>
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
<a href="https://www.digitalocean.com/community/articles/how-to-add-swap-on-ubuntu-12-04">https://www.digitalocean.com/community/articles/how-to-add-swap-on-ubuntu-12-04</a>
</p></div>

<div class="footdef"><sup><a id="fn.5" name="fn.5" class="footnum" href="#fnr.5">5</a></sup> <p class="footpara">
<a href="https://www.digitalocean.com/community/articles/how-to-install-linux-nginx-mysql-php-lemp-stack-on-ubuntu-12-04">https://www.digitalocean.com/community/articles/how-to-install-linux-nginx-mysql-php-lemp-stack-on-ubuntu-12-04</a>
</p></div>

<div class="footdef"><sup><a id="fn.6" name="fn.6" class="footnum" href="#fnr.6">6</a></sup> <p class="footpara">
<a href="https://www.digitalocean.com/community/articles/how-to-configure-single-and-multiple-wordpress-site-settings-with-nginx">https://www.digitalocean.com/community/articles/how-to-configure-single-and-multiple-wordpress-site-settings-with-nginx</a>
</p></div>

<div class="footdef"><sup><a id="fn.7" name="fn.7" class="footnum" href="#fnr.7">7</a></sup> <p class="footpara">
<a href="https://www.digitalocean.com/community/articles/how-to-migrate-wordpress-from-shared-hosting-to-a-cloud-server-with-zero-downtime">https://www.digitalocean.com/community/articles/how-to-migrate-wordpress-from-shared-hosting-to-a-cloud-server-with-zero-downtime</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-10-27 Mon 22:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
